{"format": "layers-model", "generatedBy": "keras v2.2.4-tf", "convertedBy": "TensorFlow.js Converter v2.6.0", "modelTopology": {"keras_version": "2.2.4-tf", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "Embedding", "config": {"name": "embedding_4", "trainable": true, "batch_input_shape": [null, null], "dtype": "float32", "input_dim": 11, "output_dim": 3, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_4", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_7", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 53, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_5", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_8", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 26, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "LayerNormalization", "config": {"name": "layer_normalization_1", "trainable": true, "dtype": "float32", "axis": [2], "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Bidirectional", "config": {"name": "bidirectional_6", "trainable": true, "dtype": "float32", "layer": {"class_name": "LSTM", "config": {"name": "lstm_9", "trainable": true, "dtype": "float32", "return_sequences": true, "return_state": false, "go_backwards": false, "stateful": false, "unroll": false, "time_major": false, "units": 13, "activation": "tanh", "recurrent_activation": "sigmoid", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "unit_forget_bias": true, "kernel_regularizer": null, "recurrent_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "recurrent_constraint": null, "bias_constraint": null, "dropout": 0.0, "recurrent_dropout": 0.0, "implementation": 2}}, "merge_mode": "concat"}}, {"class_name": "TimeDistributed", "config": {"name": "time_distributed_3", "trainable": true, "dtype": "float32", "layer": {"class_name": "Dense", "config": {"name": "dense_3", "trainable": true, "dtype": "float32", "units": 5, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": ["sparse_categorical_accuracy"], "weighted_metrics": null, "sample_weight_mode": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": {"class_name": "ExponentialDecay", "config": {"initial_learning_rate": 0.01, "decay_steps": 10000, "decay_rate": 0.98, "staircase": true, "name": null}}, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-08, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "bidirectional_4/forward_lstm_7/kernel", "shape": [3, 212], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_7/recurrent_kernel", "shape": [53, 212], "dtype": "float32"}, {"name": "bidirectional_4/forward_lstm_7/bias", "shape": [212], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_7/kernel", "shape": [3, 212], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_7/recurrent_kernel", "shape": [53, 212], "dtype": "float32"}, {"name": "bidirectional_4/backward_lstm_7/bias", "shape": [212], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_8/kernel", "shape": [106, 104], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_8/recurrent_kernel", "shape": [26, 104], "dtype": "float32"}, {"name": "bidirectional_5/forward_lstm_8/bias", "shape": [104], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_8/kernel", "shape": [106, 104], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_8/recurrent_kernel", "shape": [26, 104], "dtype": "float32"}, {"name": "bidirectional_5/backward_lstm_8/bias", "shape": [104], "dtype": "float32"}, {"name": "bidirectional_6/forward_lstm_9/kernel", "shape": [52, 52], "dtype": "float32"}, {"name": "bidirectional_6/forward_lstm_9/recurrent_kernel", "shape": [13, 52], "dtype": "float32"}, {"name": "bidirectional_6/forward_lstm_9/bias", "shape": [52], "dtype": "float32"}, {"name": "bidirectional_6/backward_lstm_9/kernel", "shape": [52, 52], "dtype": "float32"}, {"name": "bidirectional_6/backward_lstm_9/recurrent_kernel", "shape": [13, 52], "dtype": "float32"}, {"name": "bidirectional_6/backward_lstm_9/bias", "shape": [52], "dtype": "float32"}, {"name": "embedding_4/embeddings", "shape": [11, 3], "dtype": "float32"}, {"name": "layer_normalization/gamma", "shape": [106], "dtype": "float32"}, {"name": "layer_normalization/beta", "shape": [106], "dtype": "float32"}, {"name": "layer_normalization_1/gamma", "shape": [52], "dtype": "float32"}, {"name": "layer_normalization_1/beta", "shape": [52], "dtype": "float32"}, {"name": "time_distributed_3/kernel", "shape": [26, 5], "dtype": "float32"}, {"name": "time_distributed_3/bias", "shape": [5], "dtype": "float32"}]}]}
